backend/app/controllers/api/v1/prompts_controller.rb

  def random
    difficulty = params[:difficulty]

    prompts = if difficulty.present?
      Prompt.where(difficulty: difficulty)
---
SELECT "prompts".* FROM "prompts" WHERE "prompts"."difficulty" = 'avancado' AND "prompts"."id" NOT IN (11, 10) ORDER BY RANDOM() LIMIT 1